  
{
    "analytics": [
      {
        "kind": "Scheduled",
        "displayName": "AlertRule01",
        "description": "test",
        "severity": "Low",
        "enabled": true,
        "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine contains \"-noni -ep bypass $\"",
        "queryFrequency": "5H",
        "queryPeriod": "6H",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 5,
        "suppressionDuration": "6H",
        "suppressionEnabled": false,
        "tactics": [
          "Persistence",
          "LateralMovement",
          "Collection"
        ],
        "playbookName": ""
      },
      {
        "kind": "Scheduled",
        "displayName": "AlertRule02",
        "description": "test",
        "severity": "High",
        "enabled": true,
        "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine contains \"-noni -ep bypass $\"",
        "queryFrequency": "5H",
        "queryPeriod": "6H",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 5,
        "suppressionDuration": "6H",
        "suppressionEnabled": false,
        "tactics": [
          "Persistence",
          "LateralMovement"
        ],
        "playbookName": ""
      },
      {
        "kind": "MicrosoftSecurityIncidentCreation",
        "displayName": "Create incidents based on Azure Active Directory Identity Protection alerts",
        "description": "Create incidents based on all alerts generated in Azure Active Directory Identity Protection",
        "enabled": true,
        "productFilter": "Microsoft Cloud App Security",
        "severitiesFilter": [
          "High",
          "Medium",
          "Low"
        ],
        "displayNamesFilter": null
      },
      {
        "kind": "Fusion",
        "displayName": "Advanced Multistage Attack Detection",
        "enabled": true,
        "alertRuleTemplateName": "f71aba3d-28fb-450b-b192-4e76a83015c8"
      },
      {
        "kind": "MLBehaviorAnalytics",
        "displayName": "(Preview) Anomalous SSH Login Detection",
        "enabled": true,
        "alertRuleTemplateName": "fa118b98-de46-4e94-87f9-8e6d5060b60b"
      }
    ]
  }
